In [1]:
import pandas as pd

**Renomeando e combinando**

Renomeando colunas

In [2]:
#Criando um dataframe de exemplo
dados = {
    'Nome': [],
    'Idade': [],
    'Nota': []
}
df = pd.DataFrame(dados)
print("Dataframe de exemplo")
display(df)

Dataframe de exemplo

Empty DataFrame
Columns: [Nome, Idade, Nota]
Index: []

In [4]:
df.loc[0] = ['Ana', 23, 85]
df

  Nome  Idade  Nota
0  Ana     23    85

In [6]:
df.loc[1] = ['Bruno', 34, 90]
df.loc[2] = ['Carlos', 45, 78]
df.loc[3] = ['Diana', 29, 92]
df.loc[4] = ['Eduardo', 40, 88]
df

      Nome  Idade  Nota
0      Ana     23    85
1    Bruno     34    90
2   Carlos     45    78
3    Diana     29    92
4  Eduardo     40    88

**1. Usando o *rename()***

In [8]:
#Renomeando colunas
df_renomeado = df.rename(columns={'Nome': 'Estudante', 'Nota': 'Pontuação'})
print("Dataframe com colunas renomeadas")
display(df_renomeado)

Dataframe com colunas renomeadas

  Estudante  Idade  Pontuação
0       Ana     23         85
1     Bruno     34         90
2    Carlos     45         78
3     Diana     29         92
4   Eduardo     40         88

**2. Alterando os nomes das colunas diretamente**

In [9]:
#Alterando os nomes das colunas diretamente usando o atributo columns=
df.columns = ['Aluno', 'Idade', 'Nota final']
print("Dataframe com novos nomes de colunas:")
display(df)

Dataframe com novos nomes de colunas:

     Aluno  Idade  Nota final
0      Ana     23          85
1    Bruno     34          90
2   Carlos     45          78
3    Diana     29          92
4  Eduardo     40          88